In [1]:
import pandas as pd

In [2]:
# series = 1-dimentional

In [3]:
series = pd.Series(["BMW", "Toyota"])

In [4]:
series

0       BMW
1    Toyota
dtype: object

In [5]:
colours = pd.Series(["Red", "Yellow"])

In [6]:
#DataFrame - 2-Dimentional

In [7]:
car_data = pd.DataFrame({"Car Data": series, "Colour": colours})
car_data

  Car Data  Colour
0      BMW     Red
1   Toyota  Yellow

In [8]:
car_data = pd.DataFrame({"Car Data": series, "Colour": colours})
car_data

  Car Data  Colour
0      BMW     Red
1   Toyota  Yellow

In [9]:
# Import Data

In [10]:
car_sales = pd.read_csv("car-sales.csv")

In [11]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [12]:
car_data = pd.DataFrame({"Car Data": series, "Colour": colours})
car_data

  Car Data  Colour
0      BMW     Red
1   Toyota  Yellow

### axis = o -> Row
### axix = 1 -> Column

In [13]:
car_sales.to_csv("exported-car_sales.csv", index = False)
#Index = false doesnt make the indexes in current data as anotehr column in the new data

In [14]:
exported_sales = pd.read_csv("exported-car_sales.csv")

In [15]:
exported_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Describing Data

In [19]:
# Attribute
car_sales.dtypes

#Function
#car_sales.to_csv()

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [21]:
car_columns =car_sales.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [22]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [23]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [25]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [27]:
car_sales.mean(numeric_only=True)

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [28]:
car_prices = pd.Series([300,1500,11120])

In [29]:
car_prices.mean()

4306.666666666667

In [30]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [31]:
car_sales["Doors"].sum()

40

In [32]:
len(car_sales)

10